app/controllers/restaurants_controller.rb

	def index
		#Query results will be
		@restaurant_search_results = Restaurant.where('restaurant_name LIKE ?', "%#{params[:restaurant_query].to_s.capitalize}%");
---
SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."restaurant_name" = $1  [["restaurant_name", "s"]]

	def show
		#First, retrieve restaurant
		@restaurant = Restaurant.find(params[:id]);
		#Call related menu to current restaurant
		@menu = Menu.find(@restaurant.menu_id);
		#Call menu_items that belong to menu
		@menu_items = MenuItem.where(menu_id: @menu.id);
		#To best partition the menu, we select items by their menu section.
		@menu_sections = MenuItem.select(:menu_section).distinct;
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "menus".* FROM "menus" WHERE "menus"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "menu_items".* FROM "menu_items" WHERE "menu_items"."item_id" IN (SELECT "menu_menu_items"."id" FROM "menu_menu_items" WHERE "menu_menu_items"."menu_id" IN (SELECT "menus"."id" FROM "menus" WHERE "menus"."res_id" = $1))  [["res_id", 5]]
SELECT "menu_menu_items".* FROM "menu_menu_items" WHERE "menu_menu_items"."menu_id" = 1
SELECT DISTINCT "menu_items"."menu_section" FROM "menu_items"